{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\dalla\Google Drive\project_files\icvs_inequality\scripts\icvs_analysis_21_09_21.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Sep 2021, 13:23:06

{com}. use "C:/Users/dalla/Google Drive/data_files/icvs_pwt_swiid/data/iv_2005_mod.dta", clear

. 
. *1. empty model

. 
. mixed num_victim_5yr  || country:
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-65929.825}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-65929.825}  (backed up)
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}    52,908
{txt}Group variable: {res}country{col 49}{txt}Number of groups{col 67}={col 69}{res}        28

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}       563
{txt}{col 63}avg{col 67}={col 69}{res}   1,889.6
{txt}{col 63}max{col 67}={col 69}{res}     6,494

{col 49}{txt}Wald chi2({res}0{txt}){col 67}={col 70}{res}        .
{txt}Log likelihood = {res}-65929.825{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}num_victim_~r{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}_cons {c |}{col 15}{res}{space 2} .5587383{col 27}{space 2} .0287763{col 38}{space 1}   19.42{col 47}{space 3}0.000{col 55}{space 4} .5023377{col 68}{space 3} .6151388
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{col 19}var(_cons){col 30}{c |}{res}{col 33} .0226929{col 44} .0061614{col 58} .0133284{col 70}  .038637
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .7062847{col 44} .0043436{col 58} .6978226{col 70} .7148495
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}2089.92{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000

{com}. 
. 
. 
. *intraclass correlation

. 
. estat icc 

{txt}Intraclass correlation

{col 1}{text}{hline 29}{c TT}{hline 12}{hline 12}{hline 12}{hline 12}
{col 1}{text}                       Level{col 30}{c |}        ICC{col 43}  Std. Err.{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 29}{c +}{hline 12}{hline 12}{hline 12}{hline 12}
{col 1}{text}                     country{col 30}{c |}{result}{space 2} .0311298{col 43}{space 1} .0081912{col 55}{space 3} .0185191{col 67}{space 3}  .051874
{col 1}{text}{hline 29}{c BT}{hline 12}{hline 12}{hline 12}{hline 12}

{com}. 
. *____________________________________________________________________

. 
. *2. First model

. 
. xtmixed num_victim_5yr gini_2004_6_cent gdppc_2004_6_scale police_eff_cent income_cent age_cent employed male [pw=individual_weight] || country:, pwscale(size)
{res}
{txt}Obtaining starting values by EM: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-63663.676}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-63663.676}  (backed up)
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}    52,908
{txt}Group variable: {res}country{col 49}{txt}Number of groups{col 67}={col 69}{res}        28

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}       563
{txt}{col 63}avg{col 67}={col 69}{res}   1,889.6
{txt}{col 63}max{col 67}={col 69}{res}     6,494

{col 49}{txt}Wald chi2({res}7{txt}){col 67}={col 70}{res}   347.18
{txt}Log pseudolikelihood = {res}-63663.676{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{ralign 79:(Std. Err. adjusted for {res:28} clusters in country)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}num_victim_~r{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
gini_2004_6~t {c |}{col 15}{res}{space 2} .0093473{col 27}{space 2} .0031851{col 38}{space 1}    2.93{col 47}{space 3}0.003{col 55}{space 4} .0031045{col 68}{space 3}   .01559
{txt}gdppc_2004_~e {c |}{col 15}{res}{space 2} .0312832{col 27}{space 2} .0230046{col 38}{space 1}    1.36{col 47}{space 3}0.174{col 55}{space 4}-.0138051{col 68}{space 3} .0763714
{txt}police_eff_~t {c |}{col 15}{res}{space 2}-.1438691{col 27}{space 2} .0116368{col 38}{space 1}  -12.36{col 47}{space 3}0.000{col 55}{space 4}-.1666768{col 68}{space 3}-.1210615
{txt}{space 2}income_cent {c |}{col 15}{res}{space 2} .0279822{col 27}{space 2} .0082501{col 38}{space 1}    3.39{col 47}{space 3}0.001{col 55}{space 4} .0118123{col 68}{space 3} .0441522
{txt}{space 5}age_cent {c |}{col 15}{res}{space 2}-.0061865{col 27}{space 2} .0007607{col 38}{space 1}   -8.13{col 47}{space 3}0.000{col 55}{space 4}-.0076775{col 68}{space 3}-.0046954
{txt}{space 5}employed {c |}{col 15}{res}{space 2}-.0038978{col 27}{space 2} .0162201{col 38}{space 1}   -0.24{col 47}{space 3}0.810{col 55}{space 4}-.0356886{col 68}{space 3}  .027893
{txt}{space 9}male {c |}{col 15}{res}{space 2} -.014924{col 27}{space 2} .0097956{col 38}{space 1}   -1.52{col 47}{space 3}0.128{col 55}{space 4}-.0341231{col 68}{space 3} .0042751
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .5530303{col 27}{space 2} .0314903{col 38}{space 1}   17.56{col 47}{space 3}0.000{col 55}{space 4} .4913105{col 68}{space 3} .6147501
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33}  .128904{col 44} .0319167{col 58} .0793429{col 70}  .209423
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .8052183{col 44} .0252531{col 58} .7572137{col 70} .8562662
{txt}{hline 29}{c BT}{hline 48}

{p 0 9 2}Warning: Sampling weights were 
specified only at the first level 
in a multilevel model. If these weights are 
indicative of overall and not conditional 
inclusion probabilities, then 
{help mixed##sampling:results may be biased}.
{p_end}

{com}. 
. 
. 
. *but actually

. 
. *xtmixed total_security num_victim_5yr gini_2004_6_cent gdppc_2004_6_scale police_eff_cent income_cent age_cent employed male [pw=individual_weight] || country:, pwscale(size)

. 
. 
. 
. *cook's D values

. 
. mltcooksd, fixed random graph
{txt}Level 2 variable is{res} country 
 
{txt}Calculating DFBETAs for the fixed effects of 
{res} gini_2004_6_cent gdppc_2004_6_scale police_eff_cent income_cent age_cent employed male _cons 
 
{txt}Cutoff value for DFBETAs is
{res}0.3780
{txt}Cutoff value for Cook's D is
{res}0.1429
 
{txt}Level-two units with Cook's D above the cut off value:

  {c TLC}{hline 15}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
  {c |} {res}         L2ID   CooksD_f   CooksD_r     CooksD {txt}{c |}
  {c LT}{hline 15}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  {c |} {res}    Argentina   .8530394    8.91961   2.466354 {txt}{c |}
  {c |} {res}United States   .3276287    .015241   .2651512 {txt}{c |}
  {c |} {res} South Africa   .1577943   .2559924   .1774339 {txt}{c |}
  {c |} {res}       Norway   .1887512   .0100751   .1530159 {txt}{c |}
  {c BLC}{hline 15}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}
   Legend: CooksD   = overall Cook's D
           CooksD_f = Cook's D fixed part
           CooksD_r = Cook's D random part
 
 
Level-two units with DFBETAs above cut off value:

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}     Argentina {txt}{c |} {res}    0.7413 {txt}{c |} {res}   -0.8217 {txt}{c |} {res}   -0.7357 {txt}{c |} {res}   -0.0563 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}   -0.0149    {txt}{c |}   {res}    0.7948    {txt}{c |}   {res} -0.4670    {txt}{c |}    {res}  0.3522    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res} United States {txt}{c |} {res}   -0.5591 {txt}{c |} {res}   -0.7876 {txt}{c |} {res}   -0.0975 {txt}{c |} {res}   -0.3289 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}   -0.1130    {txt}{c |}   {res}    0.0143    {txt}{c |}   {res} -0.0753    {txt}{c |}    {res} -0.1897    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}  South Africa {txt}{c |} {res}    0.0835 {txt}{c |} {res}    0.0175 {txt}{c |} {res}    0.2130 {txt}{c |} {res}    0.1770 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}    0.1230    {txt}{c |}   {res}    0.2220    {txt}{c |}   {res}  0.5541    {txt}{c |}    {res} -0.3401    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}        Norway {txt}{c |} {res}   -0.0401 {txt}{c |} {res}    0.0640 {txt}{c |} {res}    0.0133 {txt}{c |} {res}    0.3246 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}   -0.3758    {txt}{c |}   {res}   -0.6034    {txt}{c |}   {res}  0.2162    {txt}{c |}    {res}  0.3554    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}        Mexico {txt}{c |} {res}   -0.1063 {txt}{c |} {res}    0.0483 {txt}{c |} {res}   -0.2828 {txt}{c |} {res}    0.6633 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}    0.1455    {txt}{c |}   {res}    0.0813    {txt}{c |}   {res}  0.1539    {txt}{c |}    {res} -0.1956    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}     Australia {txt}{c |} {res}   -0.0094 {txt}{c |} {res}    0.1096 {txt}{c |} {res}   -0.2937 {txt}{c |} {res}   -0.1195 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}   -0.3487    {txt}{c |}   {res}   -0.0098    {txt}{c |}   {res} -0.3907    {txt}{c |}    {res}  0.2495    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}       Denmark {txt}{c |} {res}   -0.4007 {txt}{c |} {res}   -0.1282 {txt}{c |} {res}    0.1318 {txt}{c |} {res}    0.0591 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}    0.0093    {txt}{c |}   {res}    0.0411    {txt}{c |}   {res}  0.0767    {txt}{c |}    {res}  0.1690    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}United Kingdom {txt}{c |} {res}   -0.0815 {txt}{c |} {res}   -0.0617 {txt}{c |} {res}    0.2502 {txt}{c |} {res}   -0.5507 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}   -0.4307    {txt}{c |}   {res}   -0.1621    {txt}{c |}   {res} -0.2038    {txt}{c |}    {res}  0.1558    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}        Poland {txt}{c |} {res}    0.2515 {txt}{c |} {res}    0.3606 {txt}{c |} {res}   -0.1151 {txt}{c |} {res}    0.1922 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}    0.4322    {txt}{c |}   {res}    0.0633    {txt}{c |}   {res}  0.0637    {txt}{c |}    {res} -0.2297    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}

  {c TLC}{hline 16}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TT}{hline 12}{c TRC}
  {c |}           L2ID {c |} DFB_gini~t {c |} DFB_gdpp~e {c |} DFB_poli~t {c |} DFB_inco~t {c |}
  {c |} {res}      Portugal {txt}{c |} {res}    0.0408 {txt}{c |} {res}    0.1460 {txt}{c |} {res}   -0.0068 {txt}{c |} {res}   -0.1856 {txt}{c |}
  {c LT}{hline 16}{c BT}{c TT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 8}{c TT}{hline 3}{c BT}{hline 12}{c RT}
  {c |}   DFB_age_~t    {c |}   DFB_empl~d    {c |}   DFB_male    {c |}    DFB_cons    {c |}
  {c |}   {res}    0.2066    {txt}{c |}   {res}    0.0628    {txt}{c |}   {res}  0.3307    {txt}{c |}    {res} -0.4197    {txt}{c |}
  {c BLC}{hline 17}{c BT}{hline 17}{c BT}{hline 15}{c BT}{hline 16}{c BRC}
{res}
{com}. 
. 
. 
. *intraclass correlation

. 
. estat icc   

{txt}Residual intraclass correlation

{col 1}{text}{hline 29}{c TT}{hline 12}{hline 12}{hline 12}{hline 12}
{col 1}{text}                       Level{col 30}{c |}        ICC{col 43}  Std. Err.{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 29}{c +}{hline 12}{hline 12}{hline 12}{hline 12}
{col 1}{text}                     country{col 30}{c |}{result}{space 2} .0249871{col 43}{space 1} .0108916{col 55}{space 3} .0105574{col 67}{space 3} .0579832
{col 1}{text}{hline 29}{c BT}{hline 12}{hline 12}{hline 12}{hline 12}

{com}. 
. 
. 
. *BIC and AIC

. 
. estat ic

Akaike's information criterion and Bayesian information criterion

{txt}{hline 13}{c TT}{hline 63}
       Model {c |}        Obs  ll(null)  ll(model)      df         AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}    52,908{col 27}        .{col 38}-63663.68{col 49}    10{col 58} 127347.4{col 69} 127436.1
{txt}{hline 13}{c BT}{hline 63}
{p 15 21 2}
Note: N=Obs used in calculating BIC; see {helpb bic_note:[R] BIC note}.
{p_end}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\dalla\Google Drive\project_files\icvs_inequality\scripts\icvs_analysis_21_09_21.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}21 Sep 2021, 13:31:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}